---
kind: type
id: T:Autodesk.Revit.DB.Domain
source: html/e4c76674-370f-a9e7-728b-80a6db6430cc.htm
---
# Autodesk.Revit.DB.Domain

Type of connector domain.

## Syntax (C#)
```csharp
public enum Domain
```